#+OPTIONS: ':nil *:t -:t ::t <:t H:3 \n:nil ^:t arch:headline
#+OPTIONS: author:t broken-links:nil c:nil creator:nil
#+OPTIONS: d:(not "LOGBOOK") date:t e:t email:nil f:t inline:t num:t
#+OPTIONS: p:nil pri:nil prop:nil stat:t tags:t tasks:t tex:t
#+OPTIONS: timestamp:t title:t toc:t todo:t |:t
#+TITLE: ds18b20
#+DATE: <2016-12-20 Tue>
#+AUTHOR: Ki Young Koo
#+EMAIL: k.y.koo@exeter.ac.uk
#+LANGUAGE: en
#+SELECT_TAGS: export
#+EXCLUDE_TAGS: noexport
#+CREATOR: Emacs 25.1.1 (Org mode 9.0)

** Bash script
#+BEGIN_SRC shell :results output

  W1DIR="/sys/bus/w1/devices"

  # Exit if 1-wire directory does not exist
  if [ ! -d $W1DIR ]
  then
      echo "Can't find 1-wire device directory"
      exit 1
  fi

  # Get a list of all devices
  DEVICES=$(ls $W1DIR)
  echo $DEVICES

  # Loop through all devices
  for DEVICE in $DEVICES
  do
      # Ignore the bus master device
      if [ $DEVICE != "w1_bus_master1" ]
      then
          # Get an answer from this device
          ANSWER=$(cat $W1DIR/$DEVICE/w1_slave)

          # See if device really answered
          # When a previously existing device is removed it will
          # read 00 00 00 00 00 00 00 00 00, which results in a
          # valid CRC. That's why we need this extra test.
          echo -e "$ANSWER" | grep -q "00 00 00 00 00 00 00 00 00"

          if [ $? -ne 0 ]
          then
              # The temperature is only valid if the CRC matches
              echo -e "$ANSWER" | grep -q "YES"
              if [ $? -eq 0 ]
              then
                  # Isolate the temperature from the second line
                  TEMPERATURE=$(echo -e "$ANSWER" | grep "t=" | cut -f 2 -d "=")
		  echo $TEMPERATURE

                  # Isolate sign, integer and fraction parts so we know where
                  # the decimal point should go

                  SIGN=${TEMPERATURE:0:1}
		  echo $SIGN

                  if [ $SIGN != "-" ]
                  then
                      SIGN=""
                  else
                      TEMPERATURE=${TEMPERATURE:1:6}
                  fi

                  TEMPERATURE="000000$TEMPERATURE"
		  echo $TEMPERATURE
                  TEMPERATURE=${TEMPERATURE:(-6)}
		  echo $TEMPERATURE

		  echo '---INTEGER---'
                  INTEGER=${TEMPERATURE:0:(-3)}
		  echo $INTEGER
                  INTEGER=$((10#$INTEGER))
		  echo $INTEGER
                  FRACTION=${TEMPERATURE:(-3)}
		  echo $FRACTION

                  # Get Timestamp
                  TIMESTAMP=$(date +"%Y-%m-%d %H:%M:%S")
		  echo $TIMESTAMP

                  # Write result of this sensor

                  echo "$DEVICE=$TIMESTAMP,$SIGN$INTEGER.$FRACTION"
                  echo "$TIMESTAMP,$SIGN$INTEGER.$FRACTION" >> "/home/pi/"$DEVICE".txt"
              else
                  # A CRC was found, show error message instead
                  echo "$DEVICE=CRC error"
                  echo "$DEVICE=CRC error" >> "/home/pi/"$DEVICE".txt"
              fi
          fi

	  break
      fi
  done

#+END_SRC

#+RESULTS:
#+begin_example
28-00000371f8da 28-000004379bd1 28-000004f65f2d 28-000004f6e9d1 w1_bus_master1
4062
4
0000004062
004062
---INTEGER---
004
4
062
2016-12-20 16:44:07
28-00000371f8da=2016-12-20 16:44:07,4.062
#+end_example
